DataProcessors/МониторПроверкиРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>МониторПроверкиРасчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеДоговора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбороткаСчетаДоговоры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборотыДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборотыКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоКДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоККт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДоговора</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДоговора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Операции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборотДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборотКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнутреннийОборот</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбороткаДоговоры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборотыДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборотыКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоКДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоККт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДоговора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДоговора</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПоСчетам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборотыДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборотыКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоКДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоККт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнутреннийОборот</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Проверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбороткаКонтрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/МониторПроверкиРасчетов/Forms/ФормаТакси/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// Установка реквизитов формы.
	ДатаОбработки = ТекущаяДатаСеанса();
	ДатаНачала 	  = НачалоМесяца(ДатаОбработки);
	ДатаОкончаня  = КонецМесяца(ДатаОбработки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧастиОбороткаКонтрагенты

&НаКлиенте
Процедура ОбороткаКонтрагентыПриАктивизацииСтроки(Элемент)
	ИмяТабличнойЧасти = "ОбороткаКонтрагенты";
	БухгалтерскийУчетКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтотОбъект, "ОбороткаДоговоры");
КонецПроцедуры

&НаКлиенте
Процедура ОбороткаКонтрагентыПередУдалением(Элемент, Отказ)
	ИмяТабличнойЧасти = "ОбороткаКонтрагенты";
	БухгалтерскийУчетКлиент.УдалитьСтрокиПодчиненнойТабличнойЧасти(ЭтотОбъект, "ОбороткаДоговоры");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧастиОбороткаДоговоры

&НаКлиенте
Процедура ОборотыДоговораПриАктивизацииСтроки(Элемент)
	СтрокаТЧ = Элементы.ОбороткаДоговоры.ТекущиеДанные;
	Если СтрокаТЧ <> Неопределено Тогда 
		СформироватьРасшифровкуПоСчетам(СтрокаТЧ.Договор);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	Если ВСомах Тогда
		Элементы.ОбороткаСчетаДоговорыВалюта.Видимость = Ложь;
		Элементы.ОборотыДоговораВалюта.Видимость = Ложь;
	Иначе
		Элементы.ОбороткаСчетаДоговорыВалюта.Видимость = Истина;
		Элементы.ОборотыДоговораВалюта.Видимость = Истина;
	КонецЕсли;
	
	СформироватьНаСервере();
	ПроверкаДоговоров();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьРасшифровкуПоСчетам(Договор)
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Счет КАК Счет,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокДт КАК СальдоНДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокКт КАК СальдоНКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК ОборотыДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК ОборотыКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СальдоКДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт КАК СальдоККт,
	|	ХозрасчетныйОстаткиИОбороты.Субконто2.Код КАК КодДоговора,
	|	ХозрасчетныйОстаткиИОбороты.Субконто2.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончаня, , , Счет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНААвансы), &ВидыСубконто, Субконто2 = &Договор) КАК ХозрасчетныйОстаткиИОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Счет
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаНачала",		НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончаня",	КонецДня(ДатаОкончаня));
	Запрос.УстановитьПараметр("ВидыСубконто",	ВидыСубконто);
	Запрос.УстановитьПараметр("Договор",		Договор);
	
	Результат 	= Запрос.Выполнить();
	ТЗ			= Результат.Выгрузить();
	
	Объект.РасшифровкаПоСчетам.Загрузить(ТЗ);
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаДоговоров()
	Перем СчетчикСчета;
	Перем СчетчикДог;
	Перем КодДоговора;
	Перем НаимДоговора;
	Перем НаимКонтрагента;
	Счетчик = 0;
	СчетчикДог = 0;
	ТаблицаЗначений = Новый ТаблицаЗначений;		
	ТаблицаЗначений.Колонки.Добавить("Контрагент");
	ТаблицаЗначений.Колонки.Добавить("Договор");
	ТаблицаЗначений.Колонки.Добавить("Счет");
	ТаблицаЗначений.Колонки.Добавить("Содержание");
	ТаблицаЗначений.Колонки.Добавить("Регистратор");
	
	Для каждого СтрокаТЧ из Объект.ОбороткаСчетаДоговоры Цикл 
		Если Не СтрокаТЧ.Контрагент = СтрокаТЧ.Договор.Владелец Тогда 
			//ТекстСообщения =  СтрШаблон(НСтр("ru = 'В строке %1.  Данному контрагенту: %2 не соответствует текуший договор: %3 !'"),СтрокаТЧ.НомерСтроки,СтрокаТЧ.Контрагент,СтрокаТЧ.Договор);
			//БухгалтерскийУчетСервер.СообщитьОбОшибке(СтрокаТЧ.Договор, ТекстСообщения);
			ТБ = ТаблицаЗначений.Добавить();
			ТБ.Контрагент = СтрокаТЧ.Контрагент;
			ТБ.Договор = СтрокаТЧ.Договор;
			ТБ.Счет = СтрокаТЧ.Счет;
			ТБ.Содержание = "Контрагенту не соответствует текуший договор";
			ТБ.Регистратор = СтрокаТЧ.Регистратор;
			
		КонецЕсли;
		// Проверка количества счетов у договора. Если > 2, то Содержание = "Количество счетов для данного договора > 2!"
		Если Не ЗначениеЗаполнено(СтрокаТЧ.КодДоговора) Тогда
			Продолжить;
		КонецЕсли;
		Если КодДоговора = СтрокаТЧ.КодДоговора Тогда
			Счетчик = Счетчик + 1;
			КонтрагентПред = СтрокаТЧ.Контрагент;
			ДоговорПред = СтрокаТЧ.Договор;
			СчетПред = СтрокаТЧ.Счет;
		КонецЕсли;
		Если КодДоговора <> СтрокаТЧ.КодДоговора И Счетчик > 1 Тогда
			ТБ = ТаблицаЗначений.Добавить();
			ТБ.Контрагент = КонтрагентПред;
			ТБ.Договор = ДоговорПред;
			ТБ.Счет = СчетПред;
			ТБ.Содержание = "Количество счетов для данного договора больше двух!";
			Счетчик = 0;
		ИначеЕсли КодДоговора <> СтрокаТЧ.КодДоговора И Счетчик = 1 Тогда
			Счетчик = 0;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЧ.КодДоговора) Тогда
			КодДоговора = СтрокаТЧ.КодДоговора;
		КонецЕсли;
		
		// Проверка на одинаковые наименования договоров у контрагента, не д.б.
		Если НаимДоговора = СтрокаТЧ.Договор И НаимКонтрагента = СтрокаТЧ.Контрагент Тогда
			ТБ = ТаблицаЗначений.Добавить();
			ТБ.Контрагент = НаимКонтрагента;
			ТБ.Договор = НаимДоговора;
			ТБ.Содержание = "Одинаковые наименования договоров для данного контрагента!";
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЧ.Договор) И ЗначениеЗаполнено(СтрокаТЧ.Контрагент) Тогда
			НаимДоговора = СтрокаТЧ.Договор;
			НаимКонтрагента = СтрокаТЧ.Контрагент;
		КонецЕсли;
		
	КонецЦикла;	
	Объект.Проверки.Загрузить(ТаблицаЗначений);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	СформироватьОбороткаСчетаДоговоры();
	СформироватьОбороткаКонтрагентыИДоговоры();
КонецПроцедуры

&НаСервере
Процедура СформироватьОбороткаСчетаДоговоры();
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Контрагент,
		|	ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Договор,
		|	ХозрасчетныйОстаткиИОбороты.Счет КАК Счет,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстаткиИОбороты.Валюта.Наименование = ""KGS""
		|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокДт
		|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаНачальныйОстатокДт
		|	КОНЕЦ КАК СальдоНДт,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстаткиИОбороты.Валюта.Наименование = ""KGS""
		|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокКт
		|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаНачальныйОстатокКт
		|	КОНЕЦ КАК СальдоНКт,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстаткиИОбороты.Валюта.Наименование = ""KGS""
		|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаОборотДт
		|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаОборотДт
		|	КОНЕЦ КАК ОборотыДт,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстаткиИОбороты.Валюта.Наименование = ""KGS""
		|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаОборотКт
		|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаОборотКт
		|	КОНЕЦ КАК ОборотыКт,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстаткиИОбороты.Валюта.Наименование = ""KGS""
		|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт
		|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаКонечныйОстатокДт
		|	КОНЕЦ КАК СальдоКДт,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстаткиИОбороты.Валюта.Наименование = ""KGS""
		|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт
		|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаКонечныйОстатокКт
		|	КОНЕЦ КАК СальдоККт,
		|	ХозрасчетныйОстаткиИОбороты.Субконто2.Код КАК КодДоговора,
		|	ХозрасчетныйОстаткиИОбороты.Субконто2.ВидДоговора КАК ВидДоговора,
		|	ХозрасчетныйОстаткиИОбороты.Валюта.Наименование КАК Валюта
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончаня, Авто, , Счет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНААвансы), &ВидыСубконто, ) КАК ХозрасчетныйОстаткиИОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент,
		|	Договор,
		|	Счет
		|АВТОУПОРЯДОЧИВАНИЕ";	
	Запрос.УстановитьПараметр("ДатаНачала",		НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончаня",	КонецДня(ДатаОкончаня));
	Запрос.УстановитьПараметр("ВидыСубконто",	ВидыСубконто);
	
	Результат 	= Запрос.Выполнить();
	ТЗ			= Результат.Выгрузить();
	Если ВСомах Тогда
		ПараметрыОтбора = Новый Структура("Валюта","KGS");
		ТЗНов = ТЗ.Скопировать(ПараметрыОтбора);
	Иначе
		ТЗНов = ТЗ;
	КонецЕсли;
		
	Объект.ОбороткаСчетаДоговоры.Загрузить(ТЗНов);
КонецПроцедуры

&НаСервере
Процедура СформироватьОбороткаКонтрагентыИДоговоры();
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		
	Запрос = Новый Запрос;	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Контрагент,
		|	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Договор,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстаткиИОбороты.Валюта.Наименование = ""KGS""
		|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокДт
		|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаНачальныйОстатокДт
		|	КОНЕЦ КАК СальдоНДт,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстаткиИОбороты.Валюта.Наименование = ""KGS""
		|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокКт
		|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаНачальныйОстатокКт
		|	КОНЕЦ КАК СальдоНКт,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстаткиИОбороты.Валюта.Наименование = ""KGS""
		|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаОборотДт
		|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаОборотДт
		|	КОНЕЦ КАК ОборотыДт,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстаткиИОбороты.Валюта.Наименование = ""KGS""
		|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаОборотКт
		|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаОборотКт
		|	КОНЕЦ КАК ОборотыКт,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстаткиИОбороты.Валюта.Наименование = ""KGS""
		|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт
		|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаКонечныйОстатокДт
		|	КОНЕЦ КАК СальдоКДт,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстаткиИОбороты.Валюта.Наименование = ""KGS""
		|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт
		|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаКонечныйОстатокКт
		|	КОНЕЦ КАК СальдоККт,
		|	ХозрасчетныйОстаткиИОбороты.Субконто1.Код КАК КодДоговора,
		|	ХозрасчетныйОстаткиИОбороты.Субконто1.ВидДоговора КАК ВидДоговора,
		|	ХозрасчетныйОстаткиИОбороты.Валюта.Наименование КАК Валюта
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончаня, Авто, , Счет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНААвансы), &ВидыСубконто, ) КАК ХозрасчетныйОстаткиИОбороты
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ВСомах
		|				ТОГДА ХозрасчетныйОстаткиИОбороты.Валюта.Наименование = &КодВалюты
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент,
		|	Договор
		|ИТОГИ ПО
		|	Контрагент
		|АВТОУПОРЯДОЧИВАНИЕ";	
	Запрос.УстановитьПараметр("ДатаНачала",		НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончаня",	КонецДня(ДатаОкончаня));
	Запрос.УстановитьПараметр("ВидыСубконто",	ВидыСубконто);
	Запрос.УстановитьПараметр("ВСомах",			ВСомах);
	Запрос.УстановитьПараметр("КодВалюты",		"KGS");
	
	ВыборкаКонтрагенты 	= Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Объект.ОбороткаКонтрагенты.Очистить();
	Объект.ОбороткаДоговоры.Очистить();
	КлючСвязи = 1;
	
	Пока ВыборкаКонтрагенты.Следующий() Цикл		
		СтрокаТабличнойЧасти = Объект.ОбороткаКонтрагенты.Добавить();
		СтрокаТабличнойЧасти.Контрагент = ВыборкаКонтрагенты.Контрагент;
		СтрокаТабличнойЧасти.КлючСвязи	= КлючСвязи;
		
		ВыборкаДоговоры = ВыборкаКонтрагенты.Выбрать();
		Пока ВыборкаДоговоры.Следующий() Цикл
			СтрокаТабличнойЧасти = Объект.ОбороткаДоговоры.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыборкаДоговоры);
			СтрокаТабличнойЧасти.КлючСвязи = КлючСвязи;
		КонецЦикла;	
		
		КлючСвязи = КлючСвязи + 1;
	КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	 Если ТекущаяСТраница = Элементы.ГруппаОперации Тогда 
		 СТЧ = Элементы.ОбороткаДоговоры.ТекущиеДанные;
		 Если СТЧ = Неопределено Тогда 
			 Возврат;
		 КонецЕсли;
         СтрукутураДанных = Новый Структура;
		 СтрукутураДанных.Вставить("Договор", СТЧ.Договор);
		 СтрукутураДанных.Вставить("ОборотКт", СТЧ.ОборотыКт);
		 СтрукутураДанных.Вставить("ОборотДт", СТЧ.ОборотыДт);
		 
		 
		 СформироватьОперации(СтрукутураДанных);	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СформироватьОперации(СТЧ)
	
		
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	РБ.Период КАК Дата,
	 |	РБ.Регистратор КАК Документ,
	 |	РБ.СчетДт,
	 |	РБ.СчетКт,
	 |	РБ.Сумма КАК ОборотДт,
	 |	0 КАК ОборотКт,
	 |	РБ.Содержание,
	 |	РБ.ВидСубконтоДт1,
	 |	РБ.ВидСубконтоДт2,
	 |	0 КАК ВнутреннийОборот,
	 |	ЗНАЧЕНИЕ(ПЛанВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка) КАК ВидСубконтоКт1,
	 |	ЗНАЧЕНИЕ(ПЛанВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка) КАК ВидСубконтоКт2
	 |ИЗ
	 |	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	 |			&ДатаНачала,
	 |			&ДатаОкончаня,
	 |			ВидСубконтоДт1 = ЗНАЧЕНИЕ(ПЛанВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты)
	 |				И ВидСубконтоДт2 = ЗНАЧЕНИЕ(ПЛанВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры)
	 |				И СубконтоДт2 = &Договор
	 |				И СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНААвансы),
	 |			,
	 |			) КАК РБ
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	РБ.Период,
	 |	РБ.Регистратор,
	 |	РБ.СчетДт,
	 |	РБ.СчетКт,
	 |	0,
	 |	РБ.Сумма,
	 |	РБ.Содержание,
	 |	0,
	 |	ЗНАЧЕНИЕ(ПЛанВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка),
	 |	ЗНАЧЕНИЕ(ПЛанВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка),
	 |	РБ.ВидСубконтоКт1,
	 |	РБ.ВидСубконтоКт2
	 |ИЗ
	 |	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	 |			&ДатаНачала,
	 |			&ДатаОкончаня,
	 |			ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПЛанВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты)
	 |				И ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПЛанВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры)
	 |				И СубконтоКт2 = &Договор
	 |				И СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНААвансы),
	 |			,
	 |			) КАК РБ
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	РБ.Период,
	 |	РБ.Регистратор
	 |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ДатаНачала",		НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончаня",	КонецДня(ДатаОкончаня));
	Запрос.УстановитьПараметр("ВидыСубконто",	ВидыСубконто);
	Запрос.УстановитьПараметр("Договор",		СТЧ.Договор);
	
	Результат 	= Запрос.Выполнить();
	ТЗ			= Результат.Выгрузить();
	
	Объект.Операции.Загрузить(ТЗ);
	
	Для Каждого СтрокаТЧ Из Объект.Операции Цикл 
		Если СтрокаТЧ.ОборотДт = СТЧ.ОборотКт Тогда 
			СтрокаТЧ.ВнутреннийОборот = СТЧ.ОборотДт; 			
		КонецЕсли; 
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
